; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v6 ?v7)
             (pred_12 ?v8 ?v12)
             (pred_6 ?v6 ?v12)
             (pred_5 ?v1 ?v6 )
	     (pred_9 ?v6)
             (pred_4 ?v10)
             (pred_10 ?v8)
             (pred_3 ?v12)
             (pred_1 ?v6)
             (pred_11 ?v8)
             (pred_2 ?v6)
             (pred_7 ))



(:action op_1
:parameters (?v4 ?v9 ?v5 ?v3)
:precondition (and (pred_4 ?v4) (pred_4 ?v9) (pred_10 ?v5) (pred_3 ?v3)
          (pred_8 ?v4 ?v9) (pred_12 ?v5 ?v3)
                   (pred_6 ?v9 ?v3) (pred_9 ?v4) 
                   (pred_1 ?v9) (pred_11 ?v5))
:effect (and  (pred_2 ?v9) (not (pred_1 ?v9))))


(:action op_2
:parameters (?v4 ?v2)
:precondition (and (pred_4 ?v4) (pred_4 ?v2)
               (pred_9 ?v4) (pred_8 ?v4 ?v2) (pred_2 ?v2))
:effect (and (pred_9 ?v2) (not (pred_9 ?v4))))

(:action op_5
:parameters (?v4 ?v5)
:precondition (and (pred_4 ?v4) (pred_10 ?v5) 
                  (pred_9 ?v4) (pred_5 ?v5 ?v4) (pred_7 ))
:effect (and (pred_11 ?v5)
   (not (pred_5 ?v5 ?v4)) (not (pred_7 ))))


(:action op_4
:parameters (?v4 ?v11 ?v13)
:precondition (and (pred_4 ?v4) (pred_10 ?v11) (pred_10 ?v13)
                  (pred_9 ?v4) (pred_11 ?v13) (pred_5 ?v11 ?v4))
:effect (and (pred_11 ?v11) (pred_5 ?v13 ?v4)
        (not (pred_11 ?v13)) (not (pred_5 ?v11 ?v4))))

(:action op_3
:parameters (?v4 ?v5)
:precondition (and (pred_4 ?v4) (pred_10 ?v5) 
                  (pred_9 ?v4) (pred_11 ?v5))
:effect (and (pred_7 ) (pred_5 ?v5 ?v4) (not (pred_11 ?v5)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_14 obj_15 obj_12 obj_10 obj_21 obj_03 obj_18 obj_19 obj_06 obj_13 obj_04 obj_11 obj_16 obj_05 obj_09
    obj_08 obj_07
    obj_17 obj_20 obj_01
    )

    (:init
       (pred_7)

       (pred_4 obj_02)
       (pred_4 obj_14)
       (pred_4 obj_15)
       (pred_4 obj_12)
       (pred_4 obj_10)
       (pred_4 obj_21)
       (pred_4 obj_03)
       (pred_4 obj_18)
       (pred_4 obj_19)
       (pred_4 obj_06)
       (pred_4 obj_13)
       (pred_4 obj_04)
       (pred_4 obj_11)
       (pred_4 obj_16)
       (pred_4 obj_05)
       (pred_4 obj_09)
       (pred_3 obj_08)
       (pred_3 obj_07)
       (pred_10 obj_17)
       (pred_10 obj_20)
       (pred_10 obj_01)

       (pred_8 obj_02 obj_10)
       (pred_8 obj_02 obj_14)
       (pred_8 obj_14 obj_21)
       (pred_8 obj_14 obj_15)
       (pred_8 obj_14 obj_02)
       (pred_8 obj_15 obj_03)
       (pred_8 obj_15 obj_12)
       (pred_8 obj_15 obj_14)
       (pred_8 obj_12 obj_18)
       (pred_8 obj_12 obj_15)
       (pred_8 obj_10 obj_19)
       (pred_8 obj_10 obj_21)
       (pred_8 obj_10 obj_02)
       (pred_8 obj_21 obj_06)
       (pred_8 obj_21 obj_03)
       (pred_8 obj_21 obj_14)
       (pred_8 obj_21 obj_10)
       (pred_8 obj_03 obj_13)
       (pred_8 obj_03 obj_18)
       (pred_8 obj_03 obj_15)
       (pred_8 obj_03 obj_21)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_18 obj_12)
       (pred_8 obj_18 obj_03)
       (pred_8 obj_19 obj_11)
       (pred_8 obj_19 obj_06)
       (pred_8 obj_19 obj_10)
       (pred_8 obj_06 obj_16)
       (pred_8 obj_06 obj_13)
       (pred_8 obj_06 obj_21)
       (pred_8 obj_06 obj_19)
       (pred_8 obj_13 obj_05)
       (pred_8 obj_13 obj_04)
       (pred_8 obj_13 obj_03)
       (pred_8 obj_13 obj_06)
       (pred_8 obj_04 obj_09)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_04 obj_13)
       (pred_8 obj_11 obj_16)
       (pred_8 obj_11 obj_19)
       (pred_8 obj_16 obj_05)
       (pred_8 obj_16 obj_06)
       (pred_8 obj_16 obj_11)
       (pred_8 obj_05 obj_09)
       (pred_8 obj_05 obj_13)
       (pred_8 obj_05 obj_16)
       (pred_8 obj_09 obj_04)
       (pred_8 obj_09 obj_05)
       (pred_1 obj_09)
       (pred_1 obj_04)
       (pred_1 obj_06)
       (pred_6  obj_09 obj_08)
       (pred_6  obj_04 obj_07)
       (pred_6  obj_06 obj_07)
       (pred_2 obj_02)
       (pred_2 obj_14)
       (pred_2 obj_15)
       (pred_2 obj_12)
       (pred_2 obj_10)
       (pred_2 obj_21)
       (pred_2 obj_03)
       (pred_2 obj_18)
       (pred_2 obj_19)
       (pred_2 obj_13)
       (pred_2 obj_11)
       (pred_2 obj_16)
       (pred_2 obj_05)

       (pred_12  obj_17 obj_08)
       (pred_12  obj_20 obj_07)
       (pred_12  obj_01 obj_07)
       (pred_5 obj_17 obj_03)
       (pred_5 obj_20 obj_21)
       (pred_5 obj_01 obj_16)
       (pred_9 obj_21)
    )

    (:goal (and
       (pred_5 obj_17 obj_12)
       (pred_5 obj_20 obj_14)
       (pred_5 obj_01 obj_13)
    ))
(:constraints
  (always (not (pred_9 obj_05)))
)
)

; plan
1. (op_5 obj_21 obj_20)
   deleted: (pred_5 obj_20 obj_21) (pred_7)
   added: (pred_11 obj_20)
   goals met: 0 of 3
2. (op_2 obj_21 obj_03)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_03)
   goals met: 0 of 3
3. (op_4 obj_03 obj_17 obj_20)
   deleted: (pred_11 obj_20) (pred_5 obj_17 obj_03)
   added: (pred_11 obj_17) (pred_5 obj_20 obj_03)
   goals met: 0 of 3
4. (op_2 obj_03 obj_13)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_13)
   goals met: 0 of 3
5. (op_3 obj_13 obj_17)
   deleted: (pred_11 obj_17)
   added: (pred_7) (pred_5 obj_17 obj_13)
   goals met: 0 of 3
6. (op_2 obj_13 obj_03)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_03)
   goals met: 0 of 3
7. (op_5 obj_03 obj_20)
   deleted: (pred_5 obj_20 obj_03) (pred_7)
   added: (pred_11 obj_20)
   goals met: 0 of 3
8. (op_2 obj_03 obj_15)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_15)
   goals met: 0 of 3
9. (op_2 obj_15 obj_14)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_14)
   goals met: 0 of 3
10. (op_2 obj_14 obj_21)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_21)
   goals met: 0 of 3
11. (op_1 obj_21 obj_06 obj_20 obj_07)
   deleted: (pred_1 obj_06)
   added: (pred_2 obj_06)
   goals met: 0 of 3
12. (op_2 obj_21 obj_06)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_06)
   goals met: 0 of 3
13. (op_2 obj_06 obj_16)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_16)
   goals met: 0 of 3
14. (op_4 obj_16 obj_01 obj_20)
   deleted: (pred_11 obj_20) (pred_5 obj_01 obj_16)
   added: (pred_11 obj_01) (pred_5 obj_20 obj_16)
   goals met: 0 of 3
15. (op_2 obj_16 obj_06)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_06)
   goals met: 0 of 3
16. (op_2 obj_06 obj_13)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_13)
   goals met: 0 of 3
17. (op_4 obj_13 obj_17 obj_01)
   deleted: (pred_11 obj_01) (pred_5 obj_17 obj_13)
   added: (pred_11 obj_17) (pred_5 obj_01 obj_13)
   goals met: 1 of 3
18. (op_2 obj_13 obj_06)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_06)
   goals met: 1 of 3
19. (op_2 obj_06 obj_21)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_21)
   goals met: 1 of 3
20. (op_3 obj_21 obj_17)
   deleted: (pred_11 obj_17)
   added: (pred_7) (pred_5 obj_17 obj_21)
   goals met: 1 of 3
21. (op_2 obj_21 obj_06)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_06)
   goals met: 1 of 3
22. (op_2 obj_06 obj_16)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_16)
   goals met: 1 of 3
23. (op_5 obj_16 obj_20)
   deleted: (pred_5 obj_20 obj_16) (pred_7)
   added: (pred_11 obj_20)
   goals met: 1 of 3
24. (op_2 obj_16 obj_06)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_06)
   goals met: 1 of 3
25. (op_2 obj_06 obj_21)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_21)
   goals met: 1 of 3
26. (op_2 obj_21 obj_14)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_14)
   goals met: 1 of 3
27. (op_3 obj_14 obj_20)
   deleted: (pred_11 obj_20)
   added: (pred_7) (pred_5 obj_20 obj_14)
   goals met: 2 of 3
28. (op_2 obj_14 obj_21)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_21)
   goals met: 2 of 3
29. (op_5 obj_21 obj_17)
   deleted: (pred_5 obj_17 obj_21) (pred_7)
   added: (pred_11 obj_17)
   goals met: 2 of 3
30. (op_2 obj_21 obj_14)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_14)
   goals met: 2 of 3
31. (op_2 obj_14 obj_15)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_15)
   goals met: 2 of 3
32. (op_2 obj_15 obj_12)
   deleted: (pred_9 obj_15)
   added: (pred_9 obj_12)
   goals met: 2 of 3
33. (op_3 obj_12 obj_17)
   deleted: (pred_11 obj_17)
   added: (pred_7) (pred_5 obj_17 obj_12)
   goals met: 3 of 3
